###################################################################

# Created by write_sdc on Wed Jun  6 02:40:33 2018

###################################################################
set sdc_version 1.8

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_driving_cell -lib_cell INVX1 [get_ports clk]
set_driving_cell -lib_cell INVX1 [get_ports reset]
set_driving_cell -lib_cell INVX1 [get_ports {memoryData[31]}]
set_driving_cell -lib_cell INVX1 [get_ports {memoryData[30]}]
set_driving_cell -lib_cell INVX1 [get_ports {memoryData[29]}]
set_driving_cell -lib_cell INVX1 [get_ports {memoryData[28]}]
set_driving_cell -lib_cell INVX1 [get_ports {memoryData[27]}]
set_driving_cell -lib_cell INVX1 [get_ports {memoryData[26]}]
set_driving_cell -lib_cell INVX1 [get_ports {memoryData[25]}]
set_driving_cell -lib_cell INVX1 [get_ports {memoryData[24]}]
set_driving_cell -lib_cell INVX1 [get_ports {memoryData[23]}]
set_driving_cell -lib_cell INVX1 [get_ports {memoryData[22]}]
set_driving_cell -lib_cell INVX1 [get_ports {memoryData[21]}]
set_driving_cell -lib_cell INVX1 [get_ports {memoryData[20]}]
set_driving_cell -lib_cell INVX1 [get_ports {memoryData[19]}]
set_driving_cell -lib_cell INVX1 [get_ports {memoryData[18]}]
set_driving_cell -lib_cell INVX1 [get_ports {memoryData[17]}]
set_driving_cell -lib_cell INVX1 [get_ports {memoryData[16]}]
set_driving_cell -lib_cell INVX1 [get_ports {memoryData[15]}]
set_driving_cell -lib_cell INVX1 [get_ports {memoryData[14]}]
set_driving_cell -lib_cell INVX1 [get_ports {memoryData[13]}]
set_driving_cell -lib_cell INVX1 [get_ports {memoryData[12]}]
set_driving_cell -lib_cell INVX1 [get_ports {memoryData[11]}]
set_driving_cell -lib_cell INVX1 [get_ports {memoryData[10]}]
set_driving_cell -lib_cell INVX1 [get_ports {memoryData[9]}]
set_driving_cell -lib_cell INVX1 [get_ports {memoryData[8]}]
set_driving_cell -lib_cell INVX1 [get_ports {memoryData[7]}]
set_driving_cell -lib_cell INVX1 [get_ports {memoryData[6]}]
set_driving_cell -lib_cell INVX1 [get_ports {memoryData[5]}]
set_driving_cell -lib_cell INVX1 [get_ports {memoryData[4]}]
set_driving_cell -lib_cell INVX1 [get_ports {memoryData[3]}]
set_driving_cell -lib_cell INVX1 [get_ports {memoryData[2]}]
set_driving_cell -lib_cell INVX1 [get_ports {memoryData[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {memoryData[0]}]
set_driving_cell -lib_cell INVX1 [get_ports memoryReady]
create_clock [get_ports clk]  -period 2  -waveform {0 1}
set_input_delay -clock clk  0.1  [get_ports reset]
set_input_delay -clock clk  0.1  [get_ports {memoryData[31]}]
set_input_delay -clock clk  0.1  [get_ports {memoryData[30]}]
set_input_delay -clock clk  0.1  [get_ports {memoryData[29]}]
set_input_delay -clock clk  0.1  [get_ports {memoryData[28]}]
set_input_delay -clock clk  0.1  [get_ports {memoryData[27]}]
set_input_delay -clock clk  0.1  [get_ports {memoryData[26]}]
set_input_delay -clock clk  0.1  [get_ports {memoryData[25]}]
set_input_delay -clock clk  0.1  [get_ports {memoryData[24]}]
set_input_delay -clock clk  0.1  [get_ports {memoryData[23]}]
set_input_delay -clock clk  0.1  [get_ports {memoryData[22]}]
set_input_delay -clock clk  0.1  [get_ports {memoryData[21]}]
set_input_delay -clock clk  0.1  [get_ports {memoryData[20]}]
set_input_delay -clock clk  0.1  [get_ports {memoryData[19]}]
set_input_delay -clock clk  0.1  [get_ports {memoryData[18]}]
set_input_delay -clock clk  0.1  [get_ports {memoryData[17]}]
set_input_delay -clock clk  0.1  [get_ports {memoryData[16]}]
set_input_delay -clock clk  0.1  [get_ports {memoryData[15]}]
set_input_delay -clock clk  0.1  [get_ports {memoryData[14]}]
set_input_delay -clock clk  0.1  [get_ports {memoryData[13]}]
set_input_delay -clock clk  0.1  [get_ports {memoryData[12]}]
set_input_delay -clock clk  0.1  [get_ports {memoryData[11]}]
set_input_delay -clock clk  0.1  [get_ports {memoryData[10]}]
set_input_delay -clock clk  0.1  [get_ports {memoryData[9]}]
set_input_delay -clock clk  0.1  [get_ports {memoryData[8]}]
set_input_delay -clock clk  0.1  [get_ports {memoryData[7]}]
set_input_delay -clock clk  0.1  [get_ports {memoryData[6]}]
set_input_delay -clock clk  0.1  [get_ports {memoryData[5]}]
set_input_delay -clock clk  0.1  [get_ports {memoryData[4]}]
set_input_delay -clock clk  0.1  [get_ports {memoryData[3]}]
set_input_delay -clock clk  0.1  [get_ports {memoryData[2]}]
set_input_delay -clock clk  0.1  [get_ports {memoryData[1]}]
set_input_delay -clock clk  0.1  [get_ports {memoryData[0]}]
set_input_delay -clock clk  0.1  [get_ports memoryReady]
set_output_delay -clock clk  0.1  [get_ports {memoryData[31]}]
set_output_delay -clock clk  0.1  [get_ports {memoryData[30]}]
set_output_delay -clock clk  0.1  [get_ports {memoryData[29]}]
set_output_delay -clock clk  0.1  [get_ports {memoryData[28]}]
set_output_delay -clock clk  0.1  [get_ports {memoryData[27]}]
set_output_delay -clock clk  0.1  [get_ports {memoryData[26]}]
set_output_delay -clock clk  0.1  [get_ports {memoryData[25]}]
set_output_delay -clock clk  0.1  [get_ports {memoryData[24]}]
set_output_delay -clock clk  0.1  [get_ports {memoryData[23]}]
set_output_delay -clock clk  0.1  [get_ports {memoryData[22]}]
set_output_delay -clock clk  0.1  [get_ports {memoryData[21]}]
set_output_delay -clock clk  0.1  [get_ports {memoryData[20]}]
set_output_delay -clock clk  0.1  [get_ports {memoryData[19]}]
set_output_delay -clock clk  0.1  [get_ports {memoryData[18]}]
set_output_delay -clock clk  0.1  [get_ports {memoryData[17]}]
set_output_delay -clock clk  0.1  [get_ports {memoryData[16]}]
set_output_delay -clock clk  0.1  [get_ports {memoryData[15]}]
set_output_delay -clock clk  0.1  [get_ports {memoryData[14]}]
set_output_delay -clock clk  0.1  [get_ports {memoryData[13]}]
set_output_delay -clock clk  0.1  [get_ports {memoryData[12]}]
set_output_delay -clock clk  0.1  [get_ports {memoryData[11]}]
set_output_delay -clock clk  0.1  [get_ports {memoryData[10]}]
set_output_delay -clock clk  0.1  [get_ports {memoryData[9]}]
set_output_delay -clock clk  0.1  [get_ports {memoryData[8]}]
set_output_delay -clock clk  0.1  [get_ports {memoryData[7]}]
set_output_delay -clock clk  0.1  [get_ports {memoryData[6]}]
set_output_delay -clock clk  0.1  [get_ports {memoryData[5]}]
set_output_delay -clock clk  0.1  [get_ports {memoryData[4]}]
set_output_delay -clock clk  0.1  [get_ports {memoryData[3]}]
set_output_delay -clock clk  0.1  [get_ports {memoryData[2]}]
set_output_delay -clock clk  0.1  [get_ports {memoryData[1]}]
set_output_delay -clock clk  0.1  [get_ports {memoryData[0]}]
set_output_delay -clock clk  0.1  [get_ports trap]
set_output_delay -clock clk  0.1  [get_ports memoryEnable]
set_output_delay -clock clk  0.1  [get_ports memoryReadWrite]
set_output_delay -clock clk  0.1  [get_ports {memoryAddress[31]}]
set_output_delay -clock clk  0.1  [get_ports {memoryAddress[30]}]
set_output_delay -clock clk  0.1  [get_ports {memoryAddress[29]}]
set_output_delay -clock clk  0.1  [get_ports {memoryAddress[28]}]
set_output_delay -clock clk  0.1  [get_ports {memoryAddress[27]}]
set_output_delay -clock clk  0.1  [get_ports {memoryAddress[26]}]
set_output_delay -clock clk  0.1  [get_ports {memoryAddress[25]}]
set_output_delay -clock clk  0.1  [get_ports {memoryAddress[24]}]
set_output_delay -clock clk  0.1  [get_ports {memoryAddress[23]}]
set_output_delay -clock clk  0.1  [get_ports {memoryAddress[22]}]
set_output_delay -clock clk  0.1  [get_ports {memoryAddress[21]}]
set_output_delay -clock clk  0.1  [get_ports {memoryAddress[20]}]
set_output_delay -clock clk  0.1  [get_ports {memoryAddress[19]}]
set_output_delay -clock clk  0.1  [get_ports {memoryAddress[18]}]
set_output_delay -clock clk  0.1  [get_ports {memoryAddress[17]}]
set_output_delay -clock clk  0.1  [get_ports {memoryAddress[16]}]
set_output_delay -clock clk  0.1  [get_ports {memoryAddress[15]}]
set_output_delay -clock clk  0.1  [get_ports {memoryAddress[14]}]
set_output_delay -clock clk  0.1  [get_ports {memoryAddress[13]}]
set_output_delay -clock clk  0.1  [get_ports {memoryAddress[12]}]
set_output_delay -clock clk  0.1  [get_ports {memoryAddress[11]}]
set_output_delay -clock clk  0.1  [get_ports {memoryAddress[10]}]
set_output_delay -clock clk  0.1  [get_ports {memoryAddress[9]}]
set_output_delay -clock clk  0.1  [get_ports {memoryAddress[8]}]
set_output_delay -clock clk  0.1  [get_ports {memoryAddress[7]}]
set_output_delay -clock clk  0.1  [get_ports {memoryAddress[6]}]
set_output_delay -clock clk  0.1  [get_ports {memoryAddress[5]}]
set_output_delay -clock clk  0.1  [get_ports {memoryAddress[4]}]
set_output_delay -clock clk  0.1  [get_ports {memoryAddress[3]}]
set_output_delay -clock clk  0.1  [get_ports {memoryAddress[2]}]
set_output_delay -clock clk  0.1  [get_ports {memoryAddress[1]}]
set_output_delay -clock clk  0.1  [get_ports {memoryAddress[0]}]
